nxp-mcuxpresso/mcuxsdk-examples/_boards/mcimx93wevk/common/pin_mux/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitNETPins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: Y7, peripheral: ENET1, signal: enet_mdc, pin_signal: ENET2_MDC, HYS: DISABLED, DSE: X4}
  - {pin_num: AA6, peripheral: ENET1, signal: enet_mdio, pin_signal: ENET2_MDIO, HYS: DISABLED, DSE: X4}
  - {pin_num: AA4, peripheral: ENET1, signal: 'enet_rgmii_rd, 0', pin_signal: ENET2_RD0, HYS: DISABLED, DSE: X4}
  - {pin_num: Y5, peripheral: ENET1, signal: 'enet_rgmii_rd, 1', pin_signal: ENET2_RD1, HYS: DISABLED, DSE: X4}
  - {pin_num: AA5, peripheral: ENET1, signal: 'enet_rgmii_rd, 2', pin_signal: ENET2_RD2, HYS: DISABLED, DSE: X4}
  - {pin_num: Y6, peripheral: ENET1, signal: 'enet_rgmii_rd, 3', pin_signal: ENET2_RD3, HYS: DISABLED, DSE: X4}
  - {pin_num: Y4, peripheral: ENET1, signal: enet_rgmii_rx_ctl, pin_signal: ENET2_RX_CTL, HYS: DISABLED, DSE: X4}
  - {pin_num: AA3, peripheral: ENET1, signal: enet_rgmii_rxc, pin_signal: ENET2_RXC, HYS: DISABLED, FSEL1: FAST_SLEW_RATE, DSE: X4}
  - {pin_num: T8, peripheral: ENET1, signal: 'enet_rgmii_td, 0', pin_signal: ENET2_TD0, HYS: DISABLED, PD: DISABLED, DSE: X4}
  - {pin_num: U8, peripheral: ENET1, signal: 'enet_rgmii_td, 1', pin_signal: ENET2_TD1, HYS: DISABLED, PD: DISABLED, DSE: X4}
  - {pin_num: V8, peripheral: ENET1, signal: 'enet_rgmii_td, 2', pin_signal: ENET2_TD2, HYS: DISABLED, PD: DISABLED, DSE: X4}
  - {pin_num: T10, peripheral: ENET1, signal: 'enet_rgmii_td, 3', pin_signal: ENET2_TD3, HYS: DISABLED, PD: DISABLED, DSE: X4}
  - {pin_num: V6, peripheral: ENET1, signal: enet_rgmii_tx_ctl, pin_signal: ENET2_TX_CTL, HYS: DISABLED, PD: DISABLED, DSE: X4}
  - {pin_num: U6, peripheral: ENET1, signal: enet_rgmii_txc, pin_signal: ENET2_TXC, HYS: DISABLED, PD: DISABLED, FSEL1: FAST_SLEW_RATE, DSE: X4}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitNETPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitNETPins(void) {                             /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_MDC__ENET1_MDC, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_MDC__ENET1_MDC, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_MDIO__ENET1_MDIO, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_MDIO__ENET1_MDIO, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RD0__ENET1_RGMII_RD0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RD0__ENET1_RGMII_RD0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RD1__ENET1_RGMII_RD1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RD1__ENET1_RGMII_RD1, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RD2__ENET1_RGMII_RD2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RD2__ENET1_RGMII_RD2, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RD3__ENET1_RGMII_RD3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RD3__ENET1_RGMII_RD3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RXC__ENET1_RGMII_RXC, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RXC__ENET1_RGMII_RXC, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(3U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RX_CTL__ENET1_RGMII_RX_CTL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RX_CTL__ENET1_RGMII_RX_CTL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TD0__ENET1_RGMII_TD0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TD0__ENET1_RGMII_TD0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TD1__ENET1_RGMII_TD1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TD1__ENET1_RGMII_TD1, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TD2__ENET1_RGMII_TD2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TD2__ENET1_RGMII_TD2, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TD3__ENET1_RGMII_TD3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TD3__ENET1_RGMII_TD3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TXC__ENET1_RGMII_TXC, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TXC__ENET1_RGMII_TXC, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(3U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TX_CTL__ENET1_RGMII_TX_CTL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TX_CTL__ENET1_RGMII_TX_CTL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitNETQOSPins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: AA11, peripheral: ENET_QOS, signal: enet_qos_mdc, pin_signal: ENET1_MDC, OD: DISABLED, DSE: X4}
  - {pin_num: AA10, peripheral: ENET_QOS, signal: enet_qos_mdio, pin_signal: ENET1_MDIO, OD: DISABLED, DSE: X4}
  - {pin_num: W11, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 0', pin_signal: ENET1_TD0, OD: DISABLED, PD: DISABLED, DSE: X4}
  - {pin_num: T12, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 1', pin_signal: ENET1_TD1, OD: DISABLED, PD: DISABLED, DSE: X4}
  - {pin_num: U12, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 2', pin_signal: ENET1_TD2, OD: DISABLED, PD: DISABLED, DSE: X4}
  - {pin_num: V12, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_td, 3', pin_signal: ENET1_TD3, OD: DISABLED, PD: DISABLED, DSE: X4}
  - {pin_num: V10, peripheral: ENET_QOS, signal: enet_qos_rgmii_tx_ctl, pin_signal: ENET1_TX_CTL, OD: DISABLED, PD: DISABLED, DSE: X4}
  - {pin_num: U10, peripheral: ENET_QOS, signal: ccm_enet_qos_clock_generate_tx_clk, pin_signal: ENET1_TXC, OD: DISABLED, PD: DISABLED, FSEL1: FAST_SLEW_RATE, DSE: X4}
  - {pin_num: AA7, peripheral: ENET_QOS, signal: ccm_enet_qos_clock_generate_rx_clk, pin_signal: ENET1_RXC, OD: DISABLED, FSEL1: FAST_SLEW_RATE, DSE: X4}
  - {pin_num: Y8, peripheral: ENET_QOS, signal: enet_qos_rgmii_rx_ctl, pin_signal: ENET1_RX_CTL, OD: DISABLED, DSE: X4}
  - {pin_num: AA8, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 0', pin_signal: ENET1_RD0, OD: DISABLED, DSE: X4}
  - {pin_num: Y9, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 1', pin_signal: ENET1_RD1, OD: DISABLED, DSE: X4}
  - {pin_num: AA9, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 2', pin_signal: ENET1_RD2, OD: DISABLED, DSE: X4}
  - {pin_num: Y10, peripheral: ENET_QOS, signal: 'enet_qos_rgmii_rd, 3', pin_signal: ENET1_RD3, OD: DISABLED, DSE: X4}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

